{
    "ekadashi":[
    {
      "Date": "शनिवार 09 जानेवारी",
      "name": "सफला एकादशी",
      "end": "07:09:16 ते 09:22:23 जानेवारी, 10",
      "info": "पौष महिन्याच्या कृष्ण पक्षाच्या एकादशीला सफला एकादशी म्हणतात. सफला म्हणजे यश, असा विश्वास आहे की या एकादशीला उपवास ठेवून सर्व कामे यशस्वी होतात, म्हणूनच याला सफला एकादशी म्हणतात. या दिवशी भगवान अच्युताची पूजा केली जाते.",
      "importance": "धर्मराज युधिष्ठिर आणि भगवान कृष्ण यांच्यातील संभाषण म्हणून धार्मिक ग्रंथांमध्ये सफला एकादशीचे महत्त्व वर्णन केले आहे. असे मानले जाते की सफला एकादशीचे व्रत ठेवून एक हजार अश्वमेध यज्ञांना जितका फायदा मिळू शकेल तितका लाभ मिळू शकेल. सफाळ एकादशीचा दिवस म्हणून उपवास केल्याने दु: खाचा शेवट होतो आणि नशिबाचा दिवस उघडला जातो. सफाला एकादशी उपवास केल्याने एखाद्या व्यक्तीची सर्व इच्छा आणि स्वप्ने पूर्ण होण्यास मदत होते."
    },
    {
      "Date": "रविवार 24 जानेवारी",
      "name": "पौष पुत्राद एकादशी",
      "end": "07:09:42 ते 09:24:36 जानेवारी, 25",
      "info": "पौष महिन्यातील शुक्ल पक्षाच्या एकादशीला पौष पुत्रदा एकादशी म्हणतात. या दिवशी सुदर्शन चक्रधारी भगवान विष्णूची पूजा केली जाते. असा विश्वास आहे की या व्रताचे पालन केल्याने मुलास जन्म मिळतो, म्हणूनच पौष पुत्रदा एकादशी असे म्हणतात. या उपोषणाला महिला वर्गात खूप अभिसरण आणि महत्त्व आहे. या उपोषणाच्या परिणामापासून मुलेही सुरक्षित असतात.",
      "importance": ""
    },
    {
      "Date": "रविवार 07 फेब्रुवारी",
      "name": "शटतिला एकादशी",
      "end": "",
      "info": "शतीला एकादशीला भगवान विष्णूची पूजा केली जाते. काही लोक भगवान विष्णूची उपासना वैकुंठाच्या रूपात करतात. शत्तीला एकादशीला तिळाचे विशेष महत्त्व सांगितले आहे. या दिवशी 6 प्रकारच्या तीळांचा वापर केला जातो. त्यापैकी तिळाने आंघोळ करणे, तिळाचे उकळणे, तिळाने हवन, तीळ सह तर्पण, तीळ खाणे आणि तिळ दान करणे, म्हणून त्यास शतीला एकादशी व्रत असे म्हणतात.",
      "importance": ""
    },
    {
      "Date": "मंगळवार 23 फेब्रुवारी",
      "name": "जया एकादशी",
      "end": "",
      "info": "जया एकादशीला भगवान विष्णूची पूजा केली जाते. पूजेमध्ये भगवान विष्णूने फुले, पाणी, अक्षत, रोली आणि विशेष सुगंधित पदार्थ अर्पण केले पाहिजेत. जया एकादशीचा हा व्रत खूप शुभ आहे. असे मानले जाते की या दिवशी उपवास करणार्‍यास भुताकडे जाण्याची भीती नसते.",
      "importance": ""
    },
    {
      "Date": "मंगळवार 09 मार्च",
      "name": "विजया एकादशी",
      "end": "06:47:20 ते 09:10:28 मार्च, 10",
      "info": "हिंदू धर्मात एकादशीला महत्वाची तारीख आहे, म्हणून विजया एकादशीलाही मोठे धार्मिक महत्त्व आहे. असे म्हटले जाते की या शुभ तारखेला जर भक्त पूर्ण कायदा व सराव करून उपवास पाळत असेल तर त्या उपवासात त्याच्या प्रत्येक कामात यश मिळते.",
      "importance": "असे म्हटले जाते की त्रेता युगात, जेव्हा भगवान श्री राम श्रीलंकेला चढण्यासाठी समुद्रकाठ पोचले, तेव्हा पुरुषोत्तम यांनी समुद्राच्या देवाला जाण्यासाठी प्रार्थना केली, पण समुद्राने श्री रामाला लंकेचा मार्ग दिला नाही, त्यानंतर श्री. रामने वाकदलाभ्य मुनिच्या आज्ञेनुसार विजय एकादशीचे व्रत केले ज्यामुळे समुद्राने भगवान रामाला मार्ग दिला. यासह, विजया एकादशीचे व्रत रावणावर विजय मिळविण्यात उपयुक्त ठरले आणि तेव्हापासून ही तारीख विजया एकादशी म्हणून ओळखली जाते."
    },
    {
      "Date": "गुरुवार 25 मार्च",
      "name": "आमलकी एकादशी",
      "end": "06:34:18 ते 09:00:49 मार्च, 26",
      "info": "अमलाकी एकादशीला अमलक्या एकादशी देखील म्हणतात. अमलाकी म्हणजे आंवला, जो हिंदू आणि आयुर्वेद या दोन्ही बाबतीत श्रेष्ठ असल्याचे म्हटले जाते. पद्म पुराणानुसार आंवला वृक्ष भगवान विष्णूला खूप प्रिय आहेत. आमलाच्या झाडावर श्री हरि आणि लक्ष्मी आहेत. आंवलाच्या झाडामध्ये भगवान विष्णूच्या निवासस्थानामुळे, त्याखाली भगवंताची पूजा केली जाते, यालाच आमलाकी एकादशी म्हणतात. या दिवशी, हिरवी फळे येणारे एक झाडाला आंघोळ, हिरवी फळे येणारे झाड पूजा, हिरवी फळे येणारे एक झाड दान केले पाहिजे.",
      "importance": "पद्म पुराणानुसार अमलाकी एकादशीचे व्रत केल्यास शेकडो तीर्थक्षेत्रासारखे पुण्य प्राप्त होते. अमलाकी एकादशी व्रत ठेवून एखाद्या व्यक्तीला मोक्ष प्राप्त होतो ज्यामुळे सर्व यज्ञांना फळ मिळते. जे लोक अमालाकी एकादशी व्रत ठेवत नाहीत त्यांनी देखील या एकादशीला भगवान विष्णूला आवळा द्यावा व ते स्वतःच खावे. शास्त्रानुसार आमलाकी एकादशीच्या दिवशी आवळा सेवन करणे खूप फायदेशीर आहे."
    },
    {
      "Date": "बुधवार 07 एप्रिल",
      "name": "पापमोचिनी एकादशी",
      "end": "08:42:30 ते 08:52:55 एप्रिल, 8",
      "info": "पापमोचनी एकादशी म्हणजे पापाचा नाश करणारी एकादशी. या दिवशी भगवान विष्णूची विधिने पूजा करावी. पापामोचनी एकादशीच्या दिवशी निंदा करणे आणि खोटे बोलणे टाळावे. हा व्रत ठेवून सोन्याची चोरी, मद्यपान, अहिंसा आणि भ्रूणहत्या अशा अनेक पापांच्या दोषातून मुक्त होते.",
      "importance": ""
    },
    {
      "Date": "शुक्रवार 23 एप्रिल",
      "name": "कामदा एकादशी",
      "end": "06:11:57 ते 08:44:21 एप्रिल, 24",
      "info": "कामदा एकादशीच्या दिवशी भगवान वासुदेवची पूजा केली जाते. या एकादशी व्रताला भगवान विष्णूचा सर्वोत्तम व्रत म्हटले आहे. या व्रताच्या परिणामी सर्व इच्छा पूर्ण होतात आणि पापांची समाप्ती होते. या एकादशी व्रताच्या एक दिवस आधी म्हणजेच दशमीच्या दिवशी जव, गहू आणि मूग वगैरे एकदा खाल्ल्याने भगवंताचे स्मरण करावे.",
      "importance": ""
    },
    {
      "Date": "शुक्रवार 07 मे",
      "name": "वारुथिनी एकादशी",
      "end": "06:03:58 ते 08:38:52 मे, 8",
      "info": "वरुथिनी एकादशीचे व्रत आनंद आणि सौभाग्य दर्शवितात. वरुथिनी एकादशीच्या व्रतीच्या प्रभावाने सर्व पाप, उष्णता आणि दु: ख दूर होतात आणि आपल्याला चिरंतन शक्ती मिळते. भगवान मधुसुदन यांची भक्ती केली पाहिजे. सूर्यग्रहण वेळी सोन्याचे दान करून प्राप्त केलेले फळ वरुथीनी एकादशी व्रत केल्याने मिळते. या व्रताच्या परिणामामुळे मनुष्य जगात आणि परलोकांमध्ये आनंद घेतो.",
      "importance": "हा व्रत अतिशय पुण्यवान आहे. धार्मिक मान्यता अशी आहे की वरुथिनी एकादशीचे व्रत ब्राह्मणांच्या देणगीपेक्षा, कोट्यावधी वर्षापासून ध्यान करणे आणि स्त्री दान देण्यापेक्षा जास्त आहे. हे व्रत ठेवून भगवान मधुसूदन प्रसन्न होतात. मानवी त्रास संपतो आणि शुभेच्छा वाढतात."
    },
    {
      "Date": "रविवार 23 मे",
      "name": "मोहिनी एकादशी",
      "end": "05:58:28 ते 08:35:39 मे, 24",
      "info": "मोहिनी एकादशी हिंदू धर्मातील एक अतिशय पवित्र आणि फलदायी तारीख मानली जाते. असे मानले जाते की जर एखाद्या व्यक्तीने या शुभ दिवशी उपवास केला तर त्याचे आयुष्य सुदृढ होते. व्रत पाळणारी व्यक्ती मोह मायाच्या जंगलातून बाहेर पडून मोक्षप्राप्तीकडे वळते.",
      "importance": "पौराणिक कथेनुसार, जेव्हा समुद्र मंथन केले गेले, अमृतप्राप्ति झाल्यानंतर, देवता आणि असुरांमध्ये वादळ निर्माण झाले. भगवंतांनी असुरांना पराक्रमाच्या जोरावर पराभूत करता आले नाही, म्हणून भगवान विष्णूने मोहिनीचे रूप धारण केले आणि असुरांना त्यांच्या मोह मायाच्या जाळ्यात अडकवले आणि देवतांना अमरत्व मिळवून देणार्‍या सर्वांना अमृत दिले. या कारणास्तव या एकादशीला मोहिनी एकादशी म्हटले गेले."
    },
    {
      "Date": "रविवार 06 जून",
      "name": "अपरा एकादशी",
      "end": "05:57:10 ते 08:35:39 जून, 7",
      "info": "अपारा एकादशीला अजला आणि अपारा या दोन नावांनी ओळखले जाते. या दिवशी भगवान त्रिविक्रमांची पूजा करण्याचा नियम आहे. अपारा एकादशीचा एक अर्थ असा आहे की या एकादशीचे पुण्य अपार आहे. या दिवशी उपवास केल्याने कीर्ति, पुण्य आणि संपत्तीची वाढ होते. त्याच वेळी, एखाद्याला ब्राह्मण हत्या, परनिंदा आणि फॅंटम योनीसारख्या पापांपासून स्वातंत्र्य मिळते. या दिवशी तुळशी, चंदन, कपूर, गंगेच्या पाण्याने भगवान विष्णूची पूजा करावी.",
      "importance": "पुराणात अपारा एकादशीला मोठे महत्त्व सांगितले आहे. धार्मिक मान्यतानुसार गंगाच्या काठावर पूर्वजांना पिंडदान देऊन जे फळ मिळते तेच अपरा एकादशीच्या व्रताने मिळते. कुंभातील कादरनाथ दर्शन किंवा बद्रीनाथ यांचे दर्शन, सूर्यग्रहणातील सुवर्णदान, अपारा एकादशीच्या उपवासातूनही तेच फळ प्राप्त होते."
    },
    {
      "Date": "सोमवार 21 जून",
      "name": "निर्जळ एकादशी",
      "end": "05:59:05 ते 08:38:01 जून, 22",
      "info": "एका वर्षात चोवीस एकादशी येते. त्यापैकी निर्जला एकादशी सर्वोत्तम मानली जाते. त्याला भीमसेनी एकादशी देखील म्हणतात. कारण महर्षि वेदानुसार भीमसेन हे परिधान केले. असे मानले जाते की या एकादशीचे व्रत केल्याने वर्षातील सर्व एकादशीचे व्रत होते. द्वादशीच्या सूर्योदयापासून सूर्योदय पर्यंतही पाणी न पिण्याच्या कायद्यामुळे या उपोषणाला निर्जला एकादशी म्हणतात. या दिवशी निर्जल राहून भगवान विष्णूची उपासना करण्याचा नियम आहे. हे व्रत दीर्घायुष्य आणि तारण प्राप्त करते.",
      "importance": "हे एकादशी व्रत ठेवून अन्न, पाणी, कपडे, आसन, शूज, छत्री, पाकळ्या आणि फळे इत्यादी दान कराव्यात. या दिवशी पाण्याचे कलश दान करणा devotees्या भक्तांना वर्षभर मठांचे फळ मिळते. या एकादशीला उपवास केल्याने इतर एकादशींवर अन्न खाण्याचा दोष निघून जातो आणि संपूर्ण एकादशीच्या पुण्यचा फायदा देखील होतो. जो भक्त या पवित्र एकादशीला उपवास ठेवतो, तो सर्व पापांपासून मुक्त होतो आणि अविनाशी पद मिळवितो."
    },
    {
      "Date": "सोमवार 05 जुलै",
      "name": "योगिनी एकादशी",
      "end": "06:03:00 ते 08:41:28 जुलै, 6",
      "info": "योगी एकादशीला भगवान योगी नारायण यांची पूजा केली जाते. श्री नारायण हे भगवान विष्णूचे नाव आहे. या एकादशीचे व्रत केल्याने सर्व पाप दूर होतात आणि पीपलचे झाड कापण्यासारख्या पापांपासून मुक्त होते. या उपोषणाच्या परिणामामुळे एखाद्याने दिलेला शापही दूर होतो. या एकादशीमुळे शरीराचे सर्व रोग नष्ट होतात, त्यास सुंदर स्वरूप, गुणवत्ता आणि प्रसिद्धी मिळते.",
      "importance": "योगिनी एकादशी व्रत केल्याने जीवनात समृद्धी व आनंद मिळतो. हा व्रत तिन्ही जगात प्रसिद्ध आहे. असे मानले जाते की योगिनी एकादशी व्रत ठेवून 88 हजार ब्राह्मणांना जेवण म्हणून योग्यता प्राप्त होते."
    },
    {
      "Date": "मंगळवार 20 जुलै",
      "name": "देव शयनी एकादशी",
      "end": "06:08:13 ते 08:45:15 जुलै, 21",
      "info": "एकादशी ही चंद्र महिन्यातील अकराव्या तारीख आहे. प्रत्येक चंद्र महिन्यात दोन एकादशी असतात, शुक्ल पक्षाची एकादशी आणि कृष्ण पक्षाची एकादशी. ही तारीख भगवान विष्णूला समर्पित आहे. आषाढ महिन्यात शुक्ल पक्षाच्या एकादशीला आषाढी एकादशी म्हणतात. याला देवशयनी एकादशी, हरिशयानी आणि पद्मनाभ एकादशी इ. म्हणूनही ओळखले जाते. इंग्रजी दिनदर्शिकेनुसार आषाढी एकादशी जून किंवा जुलै महिन्यात येते. हा विष्णूचा झोपेचा काळ आहे. पुराणानुसार, भगवान विष्णू आजपासून क्षीरसागरात चार महिने झोपले आहेत, म्हणूनच त्याला हरिशयनी एकादशी म्हणतात. चातुर्मास या दिवसापासून सुरू होतो.",
      "importance": "आषाढी एकादशी किंवा देवशयनी एकादशी हा भगवान विष्णूचा झोपेचा काळ आहे. हा दिवस चौमास्याचा प्रारंभ मानला जातो. भगवान विष्णू चार महिने झोपेत असल्याने विवाहासह अनेक शुभ कार्ये यावेळी निषिद्ध मानली जातात. या दिवसात, तपस्वी प्रवास करीत नाहीत, ते एकाच ठिकाणी राहून तपश्चर्या करतात. या दिवसात फक्त ब्रजला भेट दिली जाऊ शकते. कारण या चार महिन्यांत पृथ्वीवरील सर्व तीर्थे ब्रजमध्ये येऊन वास्तव्यास आहेत. आषाढी एकादशीच्या चार महिन्यांनंतर भगवान विष्णू झोपेतून उठतात, या तारखेला प्रबोधिनी एकादशी किंवा देवउठनी एकादशी म्हणतात."
    },
    {
      "Date": "बुधवार 04 ऑगस्ट",
      "name": "कामिका एकादशी",
      "end": "06:13:12 ते 08:48:07 ऑगस्ट, 5",
      "info": "कामिका एकादशीला पवित्र एकादशी म्हणूनही ओळखले जाते. या दिवशी भगवान विष्णूच्या स्वरूपाची पूजा केली जाते. ही एकादशी व्रत ठेवल्यास मागील जन्माचे अडथळे दूर होतात. या पवित्र एकादशीची फळे जगात व परलोकांत उत्कृष्ट असल्याचे सांगितले जाते. कारण या व्रताचे पालन केल्याने एक हजार गायी दान केल्यासारखे पुण्य प्राप्त होते आणि आयुष्यात आनंद आणि समृद्धी येते.",
      "importance": "कामिका एकादशीला भगवान विष्णूची उपासना करणे अत्यंत फायद्याचे मानले जाते. या उपोषणाच्या परिणामामुळे प्रत्येकजण वाईट गोष्टी करण्यास सुरवात करतो. या दिवशी भाविकांसह भगवान विष्णूची पूजा केल्यास त्यांच्या पूर्वजांचे दु: खही दूर होते. कामिका एकादशीनिमित्त तीर्थक्षेत्रांवर नदी, कुंड आणि तलावामध्ये स्नान केल्याने अश्वमेध यज्ञासारखेच फळ मिळते. श्री विष्णूला संतुष्ट करायचे असेल तर तुळशीच्या पत्राने त्याची पूजा करा. असे केल्याने, केवळ प्रभु प्रसन्न होणार नाही तर आपले सर्व कष्ट दूर होतील. कामिका एकादशीच्या व्रताची कथा ऐकणे म्हणजे यज्ञ करण्यासारखे आहे."
    },
    {
      "Date": "बुधवार 18 ऑगस्ट",
      "name": "श्रावण पुत्रदा एकादशी",
      "end": "06:34:51 ते 08:49:28 ऑगस्ट, 19",
      "info": "श्रावण महिन्याच्या शुक्ल पक्षाच्या एकादशीच्या तारखेला श्रावण पुत्रदा एकादशी म्हणतात. हिंदू धार्मिक मान्यतानुसार असे म्हणतात की श्रावण पुत्रदा एकादशीचे व्रत ठेवणार्‍याला वाजपेयी यज्ञासारखे पुण्य मिळते. याशिवाय या उपोषणाच्या सद्गुण प्रभावाने भाविकांना मुले होण्याचे वरदान लाभते.",
      "importance": "हिंदू धर्मात एकादशीला खूप महत्वाची तारीख मानली जाते आणि त्यापैकी श्रावण पुत्रदा एकादशी आहे. असा विश्वास आहे की जर संतती नसलेला जोडप्यांनी हा उपवास संपूर्ण कायदा व सुव्यवस्थेने पाळला तर त्यांना मुलाला आनंद मिळतो. या व्यतिरिक्त मनुष्याच्या सर्व पापांचा नाश होतो आणि मरणोत्तर त्याला मोक्ष प्राप्त होतो."
    },
    {
      "Date": "शुक्रवार 03 सप्टेंबर",
      "name": "अजा एकादशी",
      "end": "06:20:19 ते 08:49:38 सप्टेंबर, 4",
      "info": "अजा एकादशीला भगवान विष्णू खूप प्रिय आहेत, म्हणून या एकादशीला व्रत ठेवल्यास भगवान विष्णू आणि आई लक्ष्मी यांचे आशीर्वाद मिळतात. त्याला अन्नदा एकादशी असेही म्हणतात.",
      "importance": "हिंदू धार्मिक शास्त्रानुसार असे मानले जाते की कायद्यानुसार हा उपवास करून रात्री जागृत करणार्‍या भक्तांच्या सर्व पापांचा नाश होतो आणि शेवटी ते स्वर्गात जातात. याशिवाय केवळ अजा एकादशीची कथा ऐकून भाविकांना अश्वमेध यज्ञाचे फळ प्राप्त होते."
    },
    {
      "Date": "शुक्रवार 17 सप्टेंबर",
      "name": "पार्श्व एकादशी",
      "end": "06:22:40 ते 08:49:05 सप्टेंबर, 18",
      "info": "परलातीनी एकादशीच्या दिवशी भगवान विष्णूच्या वामन अवताराची पूजा केली जाते. या एकादशीवर श्री हरी झोपलेले आहेत, म्हणून ते एकादशीकडे वळतात आणि त्यांना परलाटिनी एकादशी म्हणतात. त्याला पद्म एकादशी असेही म्हणतात. या व्रतामध्ये भगवान विष्णूच्या वामन अवताराची उपासना केल्याने वाजपेयी यज्ञासारखेच फळ प्राप्त होतात आणि मनुष्याच्या सर्व पापांचा नाश होतो. हे लक्ष्मी देवीचे शुभ व्रत आहे, म्हणून या दिवशी लक्ष्मीची पूजा करणे चांगले मानले जाते.",
      "importance": ""
    },
    {
      "Date": "शनिवार 02 ऑक्टोबर",
      "name": "इंदिरा एकादशी",
      "end": "06:25:22 ते 08:48:40 ऑक्टोबर, 3",
      "info": "परलातीनी एकादशीच्या दिवशी भगवान विष्णूच्या वामन अवताराची पूजा केली जाते. या एकादशीवर श्री हरी झोपलेले आहेत, म्हणून ते एकादशीकडे वळतात आणि त्यांना परलाटिनी एकादशी म्हणतात. त्याला पद्म एकादशी असेही म्हणतात. या व्रतामध्ये भगवान विष्णूच्या वामन अवताराची उपासना केल्याने वाजपेयी यज्ञासारखेच फळ प्राप्त होतात आणि मनुष्याच्या सर्व पापांचा नाश होतो. हे लक्ष्मी देवीचे शुभ व्रत आहे, म्हणून या दिवशी लक्ष्मीची पूजा करणे चांगले मानले जाते.",
      "importance": ""
    },
    {
      "Date": "शनिवार 16 ऑक्टोबर",
      "name": "पापनकुश एकादशी",
      "end": "06:28:48 ते 08:49:15 ऑक्टोबर, 17",
      "info": "पापाच्या हत्तीला उपवासाचे पुण्य म्हणून व्यत्यय आणल्यामुळे हे पापकुंश एकादशी म्हटले गेले. या दिवशी शांतपणे भगवद्चे स्मरण करून भजन-कीर्तन करण्याचा कायदा आहे. अशा प्रकारे, ईश्वराची उपासना केल्याने मन शुद्ध होते आणि मानवांमध्ये पुण्य समाविष्ट होते. धार्मिक मान्यतेनुसार या एकादशी व्रताचे पालन केल्याने एखाद्या व्यक्तीला कठीण तपश्चर्येला समान पुण्य मिळते.",
      "importance": "महाभारत काळात भगवान श्रीकृष्णाने धर्मराज युधिष्ठिर यांना पापकुंश एकादशीचे महत्त्व सांगितले. भगवान श्री कृष्ण म्हणाले की ही एकादशी पापापासून बचावते, अर्थात ती पापकर्मापासून संरक्षण देते. या एकादशीचे उपवास एखाद्याला अर्थ आणि मोक्ष याची जाणीव देते. या व्रताच्या परिणामाद्वारे मनुष्याच्या साठलेल्या पापांचा नाश होतो. या दिवशी पूजा आणि भक्ती ब्राह्मणांना पूजा आणि भक्तीने करावी. या दिवशी फक्त फळ दिले जाते. हे शरीर निरोगी आणि हृदय आनंदी ठेवते."
    },
    {
      "Date": "सोमवार 01 नोव्हेंबर",
      "name": "रमा एकादशी",
      "end": "06:34:33 ते 08:51:57 नोव्हेंबर, 2",
      "info": "हिंदू धर्मात राम एकादशी खूप महत्वाची आहे. या एकादशीला लक्ष्मीच्या नावाने राम एकादशी म्हणतात. या एकादशीला भगवान विष्णूच्या पूर्णावतार केशव रूप आणि महालक्ष्मीच्या राम स्वरूपाची उपासना करण्याचा नियम आहे. चातुर्मासाची ही शेवटची एकादशी आहे. या एकादशी व्रताच्या परिणामामुळे आयुष्यात आनंद आणि भरभराट होते.",
      "importance": "पद्म पुराणात वर्णन केलेल्या वर्णनानुसार, राम एकादशी व्रत केल्याने कामधेनु आणि चिंतामणीसारखे फळ मिळतात. या व्रताचे पालन केल्याने मनुष्याच्या सर्व पाप कर्मांचा नाश होतो आणि त्याला पुण्य फल मिळते. या उपोषणाच्या परिणामामुळे, पैशाचा आणि धान्याचा अभाव दूर होतो."
    },
    {
      "Date": "सोमवार 15 नोव्हेंबर",
      "name": "देवत्तना एकादशी",
      "end": "06:41:25 ते 08:56:32 नोव्हेंबर, 16",
      "info": "कार्तिक महिन्यातील शुक्ल पक्षाच्या एकादशीला देवोत्थान, देवउठणी किंवा प्रबोधिनी एकादशी म्हणतात. ही एकादशी दिवाळीनंतर येते. शुक्ल पक्षाच्या एकादशीवर आषाढ़ देवशायना आणि कार्तिक शुक्ल पक्षाच्या एकादशीला जागतात, म्हणून त्याला देवोत्थान एकादशी म्हणतात. असे मानले जाते की देवउठनी एकादशीच्या दिवशी भगवान विष्णू क्षीरसागरात महिन्यांच्या झोपेनंतर जागे होतात. भगवान विष्णूच्या झोपेच्या चार महिन्यात लग्न वगैरे केले जात नाही, म्हणून देवोत्थान एकादशीला भगवान हरि जागृत झाल्यानंतर शुभ व मंगल कार्ये सुरू होतात. या दिवशी तुळशी विवाह देखील आयोजित केले जाते.",
      "importance": "देवउठनी एकादशीच्या दिवशीही तुळशी विवाह आयोजित केले जाते. तुळशीच्या झाडाचे आणि शालिग्रामचे हे लग्न सामान्य लग्नाप्रमाणे पूर्ण आळशी पद्धतीने केले जाते. तुळशीला विष्णू प्रिया असेही म्हणतात, जेव्हा देव जागा होतात तेव्हा सर्वप्रथम हरिल्लभ तुलसीची प्रार्थना ऐकली जाते. तुळशी विवाह म्हणजे तुळशीद्वारे थेट देवाची प्रार्थना करणे. धर्मग्रंथात असे म्हटले आहे की ज्या जोडप्यांना मुलगी नाही त्यांनी कन्यादान पुण्य मिळवण्यासाठी आयुष्यात एकदा तुळशीशी लग्न केले पाहिजे."
    },
    {
      "Date": "मंगळवार 30 नोव्हेंबर",
      "name": "उत्पन्न एकादशी",
      "end": "07:37:05 ते 09:03:31 डिसेंबर, 1",
      "info": "एकादशी मातेचा जन्म उत्पन्ना एकादशीच्या दिवशी झाला, म्हणून त्याला उत्पण एकादशी असे म्हणतात. देवी एकादशी हा विष्णूच्या शक्तीचा एक प्रकार आहे. असा विश्वास आहे की तो याच दिवशी जन्मला आणि त्याने मुर राक्षसाचा वध केला. म्हणून ही एकादशीला उत्पन एकादशी म्हणून ओळखले जाते. धार्मिक मान्यतानुसार, या दिवशी देवी एकादशीला आशीर्वाद मिळाला होता आणि या उपवासाचे वर्णन महान आणि पूजनीय असे होते. असे म्हणतात की, उत्पन एकादशीचे व्रत ठेवल्यास मनुष्याच्या भूतकाळातील आणि सध्याच्या जन्माच्या दोन्ही पापांचा नाश होतो.",
      "importance": ""
    },
    {
      "Date": "मंगळवार 14 डिसेंबर",
      "name": "मोक्षदा एकादशी",
      "end": "06:58:36 ते 09:10:58 डिसेंबर, 15",
      "info": "मोक्षदा एकादशी म्हणजे आसक्तीचा नाश करणारा. म्हणून त्याला मोक्षदा एकादशी म्हणतात. द्वापर युगात या दिवशी श्रीकृष्णाने कुरुक्षेत्रात गीतेचे ज्ञान दिले होते. म्हणून गीता जयंती देखील या दिवशी साजरी केली जाते. मोक्षदा एकादशीच्या दिवशी मानवतेला पुनर्निर्देशित करणार्‍या गीतेचा उपदेश करण्यात आला.",
      "importance": ""
    },
    {
      "Date": "गुरुवार 30 डिसेंबर",
      "name": "सफला एकादशी",
      "end": "07:06:18 ते 09:18:45 डिसेंबर, 31",
      "info": "पौष महिन्याच्या कृष्ण पक्षाच्या एकादशीला सफला एकादशी म्हणतात. सफला म्हणजे यश, असा विश्वास आहे की या एकादशीला उपवास ठेवून सर्व कामे यशस्वी होतात, म्हणूनच याला सफला एकादशी म्हणतात. या दिवशी भगवान अच्युताची पूजा केली जाते.",
      "importance": "धर्मराज युधिष्ठिर आणि भगवान कृष्ण यांच्यातील संभाषण म्हणून धार्मिक ग्रंथांमध्ये सफला एकादशीचे महत्त्व वर्णन केले आहे. असे मानले जाते की सफला एकादशीचे व्रत ठेवून एक हजार अश्वमेध यज्ञांना जितका फायदा मिळू शकेल तितका लाभ मिळू शकत नाही. सफाळ एकादशीचा दिवस म्हणून उपवास केल्याने दु: खाचा शेवट होतो आणि नशिबाचा दिवस उघडला जातो. सफाला एकादशी उपवास केल्याने एखाद्या व्यक्तीची सर्व इच्छा आणि स्वप्ने पूर्ण होण्यास मदत होते."
    }
  ],
  "pornima":[
    {
      "Date": "गुरुवार 28 जानेवारी",
      "name": "पौष पौर्णिमा व्रत",
      "start": "पौर्णिमा सुरवात 01:18:48 पासुन. जानेवारी 28, 2021 रोजी",
      "end": "पौर्णिमा समाप्ती 00:47:17 पर्यंत. जानेवारी 29, 2021 रोजी",
      "info": "हिंदू कॅलेंडरच्या पौष महिन्यात शुक्ल पक्षाच्या पौर्णिमेला पौष पौर्णिमा म्हणतात. पूर्णिमा हिंदू धर्म आणि भारतीय जीवनात खूप महत्वाची आहेत. पौर्णिमेची तारीख चंद्राला प्रिय आहे आणि या दिवशी चंद्र त्याच्या पूर्ण आकारात आहे. हिंदू धार्मिक ग्रंथांमध्ये पौष पौर्णिमेच्या दिवशी सूर्यदेवताला दान, स्नान आणि अर्घ्य देण्यास विशेष महत्त्व दिले गेले आहे. असं म्हणतात की पौष महिन्याच्या वेळी केल्या जाणार्‍या धार्मिक विधी पूर्ण झाल्यावर पौर्णिमेला स्नान करून अर्थपूर्ण होतो.पौष पौर्णिमेवरील काशी, प्रयागराज आणि हरिद्वारमध्ये गंगा स्नानास खूप महत्त्व आहे.",
      "importance": "वैदिक ज्योतिष आणि हिंदू धर्माशी संबंधित असलेल्या श्रद्धानुसार पौषला सूर्य देवाचा महिना म्हटले जाते. या महिन्यात, सूर्यदेवाची उपासना केल्यास मनुष्याला मोक्ष मिळतो. म्हणून पौष पौर्णिमेच्या दिवशी पवित्र नद्यांमध्ये स्नान करून सूर्य देवाला अर्घ्य अर्पण करण्याची परंपरा आहे. पौष महिना हा सूर्य देवाचा महिना असल्याने आणि पौर्णिमा चंद्राची तारीख आहे. म्हणूनच सूर्य आणि चंद्राचा हा अद्भुत संगम पौष पौर्णिमेच्या तारखेला होतो. या दिवशी सूर्य आणि चंद्र या दोन्ही गोष्टींची उपासना केल्याने मनोकामना पूर्ण होतात आणि जीवनातील अडथळे दूर होतात"
    },
    {
      "Date": "शनिवार 27 फेब्रुवारी",
      "name": "माघ पौर्णिमा व्रत",
      "start": "पौर्णिमा सुरवात 15:51:46 पासुन. फेब्रुवारी 26, 2021 रोजी",
      "end": "पौर्णिमा समाप्ती 13:48:45 पर्यंत. फेब्रुवारी 27, 2021 रोजी",
      "info": "हिंदू कॅलेंडरनुसार माघ महिन्यात येणार्‍या पौर्णिमेच्या तारखेस माघ पूर्णिमा असे म्हणतात. माघ पौर्णिमेला धार्मिक आणि आध्यात्मिक दृष्टिकोनातून विशेष महत्त्व आहे. या तारखेस स्नान, दान व जप करणे अत्यंत पुण्यवान असल्याचे सांगितले जाते. माघ पूर्णिमेवर माघ स्नानाचे विशेष महत्त्व सांगितले आहे. माघाच्या महिन्यात चालणारे हे स्नान पौष महिन्याच्या पौर्णिमेपासून सुरू होते आणि मघा पौर्णिमेपर्यंत चालते. कल्पवास आणि त्रिवेणी या तीर्थयात्रेमध्ये स्नानाचा शेवटचा दिवस म्हणजे माघ पूर्णिमा. हिंदूंच्या मते, माघ स्नान करतात आणि त्यांना आनंद, प्रेम, संपत्ती आणि मोक्ष देतात अशा लोकांवर भगवान माधव प्रसन्न होतात.",
      "importance": "माघ पूर्णिमाचा उगम माघ नक्षत्र या नावावरून झाला आहे. असे मानले जाते की माघ महिन्यात देवता पृथ्वीवर येतात आणि मानवी रूप धारण करतात आणि प्रयागमध्ये स्नान करतात, दान करतात आणि जप करतात. म्हणून असे म्हणतात की या दिवशी प्रयागमध्ये गंगा स्नान केल्यास सर्व इच्छा पूर्ण होतात आणि मोक्ष प्राप्त होतो. शास्त्रात लिहिलेल्या विधानांनुसार, जर माघ पूर्णिमेच्या दिवशी पुष्य नक्षत्र असेल तर या तारखेचे महत्त्व आणखी वाढते."
    },
    {
      "Date": "रविवार 28 मार्च",
      "name": "फाल्गुन पौर्णिमा व्रत",
      "start": "पौर्णिमा सुरवात 03:29:11 पासुन. मार्च 28, 2021 रोजी",
      "end": "पौर्णिमा समाप्ती 00:19:53 पर्यंत. मार्च 29, 2021 रोजी",
      "info": "हिंदू कॅलेंडरनुसार फाल्गुन महिन्यात येणार्‍या पौर्णिमेच्या तारखेस फाल्गुन पौर्णिमा म्हणतात. हिंदू धर्मात फाल्गुन पौर्णिमेला धार्मिक, सामाजिक आणि सांस्कृतिक महत्त्व आहे. या दिवशी सूर्योदयापासून ते सूर्योदय पर्यंत उपवास ठेवला जातो. धार्मिक मान्यतानुसार फाल्गुन पौर्णिमेचे व्रत केल्याने माणसाचे दु: ख दूर होते आणि भगवान विष्णूचा आशीर्वाद आहे. या दिवशी होळीचा सण साजरा केला जातो.",
      "importance": ""
    },
    {
      "Date": "मंगळवार 27 एप्रिल",
      "name": "चैत्र पौर्णिमा व्रत",
      "start": "पौर्णिमा सुरवात 12:46:12 पासुन. एप्रिल 26, 2021 रोजी",
      "end": "पौर्णिमा समाप्ती 09:03:15 पर्यंत. एप्रिल 27, 2021 रोजी",
      "info": "चैत्र महिन्यात येणार्‍या पौर्णिमेला चैत्र पौर्णिमा म्हणतात. चैत्र पौर्णिमेला चैती पूनम म्हणूनही ओळखले जाते. चैत्र महिना हा हिंदू वर्षाचा पहिला महिना असल्याने चैत्र पौर्णिमेला विशेष महत्त्व आहे. या दिवशी भगवान सत्य नारायण यांची पूजा करून, त्यांची कृपा प्राप्त करण्यासाठी पौर्णिमेच्या दिवशी उपवास करतात. रात्री चंद्राची पूजा केली जाते. उत्तर भारतात चैत्र पौर्णिमेच्या दिवशीही हनुमान जयंती साजरी केली जाते. चैत्र पौर्णिमेला नदीत स्नान करून दान, तीर्थक्षेत्र, तलाव आणि पवित्र कासके देऊन पुण्य मिळते.",
      "importance": "चैत्र पौर्णिमेला चैती पूनम देखील म्हणतात. या दिवशी भगवान कृष्णाने ब्रजमध्ये रास उत्सव तयार केला, ज्याला महारस म्हणून ओळखले जाते. या महारसात हजारोंच्या संख्येने गोपींनी भाग घेतला आणि भगवान श्री कृष्णांनी प्रत्येक गोपींबरोबर रात्रभर नृत्य केले. हे काम त्यांनी आपल्या योगमायाद्वारे केले."
    },
    {
      "Date": "बुधवार 26 मे",
      "name": "वैशाख पौर्णिमा व्रत",
      "start": "पौर्णिमा सुरवात 20:31:40 पासुन. मे 25, 2021 रोजी",
      "end": "पौर्णिमा समाप्ती 16:45:35 पर्यंत. मे 26, 2021 रोजी",
      "info": "वैशाख पूर्णिमा खूप महत्वाची आहे. या दिवशी दान व दान देणारी अनेक कामे केली जातात. याला सत्य विनायक पूर्णिमा असेही म्हणतात. भगवान विष्णूचा तेवीसावा अवतार वैशाख पूर्णिमावर महात्मा बुद्धाच्या रूपात होता, म्हणून बौद्ध धर्माचे अनुयायी हा दिवस मोठ्या आडकाठीने साजरा करतात.",
      "importance": "वैशाख पौर्णिमेला धर्मराजाची उपासना करण्याचा कायदा आहे, म्हणून या व्रताच्या परिणामामुळे अकाली मृत्यूची भीती नाही. असे मानले जाते की जेव्हा भगवान श्रीकृष्णाचे बालपणातील साथीदार सुदामा त्यांना भेटण्यासाठी द्वारकाला पोहोचले तेव्हा भगवान श्री कृष्णाने त्यांना विनायक पौर्णिमा व्रताचा नियम सांगितला. या उपोषणाच्या परिणामी सुदामाच्या सर्व गरीबीवर विजय मिळविला."
    },
    {
      "Date": "गुरुवार 24 जून",
      "name": "ज्येष्ठ पौर्णिमा व्रत",
      "start": "पौर्णिमा सुरवात 03:34:39 पासुन. जून 24, 2021 रोजी",
      "end": "पौर्णिमा समाप्ती 00:11:28 पर्यंत. जून 25, 2021 रोजी",
      "info": "हिंदू धर्मात ज्येष्ठ महिन्यातील पौर्णिमेला खूप महत्त्व आहे. धार्मिक दृष्टीकोनातून पौर्णिमेच्या दिवशी स्नान करून दान करण्याचा कायदा आहे. या दिवशी गंगा स्नान केल्यास एखाद्याची इच्छा पूर्ण होते. ज्येष्ठ पौर्णिमा हा वट पौर्णिमा म्हणून साजरा केला जातो जो वट सावित्री व्रताप्रमाणे आहे. गुजरात, महाराष्ट्र आणि दक्षिण राज्यात विशेषत: स्त्रिया साईत्री व व्रत सायंकाळी ज्येष्ठ पौर्णिमा उपवास करतात. तथापि उत्तर भारतात, हा उपवास ज्येष्ठ अमावस्येला पाळला जातो.",
      "importance": "हिंदू धर्मात ज्येष्ठ पौर्णिमेला विशेष महत्त्व आहे. या दिवसापासून भाविक गंगा जल घेऊन अमरनाथ यात्रेसाठी निघतात. हिंदू कॅलेंडरनुसार पहिला महिना हा हिंदू वर्षाचा तिसरा महिना आहे. यावेळी, पृथ्वीवर तीव्र उष्णता आहे आणि बर्‍याच नद्या आणि तलाव कोरडे पडतात किंवा त्यांची पाण्याची पातळी कमी होते. म्हणूनच, इतर महिन्यांच्या तुलनेत या महिन्यातील पाण्याचे महत्त्व वाढते. ज्येष्ठ महिन्यात गंगा दशहरा, निर्जला एकादशी अशा काही सणांनी आपल्याला मुनिंनी पाण्याचे महत्त्व ओळखण्याचा संदेश दिला आहे."
    },
    {
      "Date": "शनिवार 24 जुलै",
      "name": "आषाढ पौर्णिमा व्रत",
      "start": "पौर्णिमा सुरवात 10:45:30 पासुन. जुलै 23, 2021 रोजी",
      "end": "पौर्णिमा समाप्ती 08:08:37 पर्यंत. जुलै 24, 2021 रोजी",
      "info": "आषाढ महिन्याच्या पौर्णिमेला गुरु पौर्णिमा म्हणतात. या दिवशी गुरूची पूजा केली जाते. सोप्या भाषेत, गुरु म्हणजे अशी व्यक्ती जी ज्ञानाची गंगा फेकते आणि अंधारापासून प्रकाशाकडे नेते. हा उत्सव संपूर्ण भारतभर मोठ्या श्रद्धेने साजरा केला जातो. पौराणिक काळाच्या महान व्यक्तिमत्त्वांची रचना करणारे महर्षि वेद व्यास जी, ब्रह्मसूत्र, महाभारत, श्रीमद्भागवत आणि अठरा पुराणांसारख्या अप्रतिम साहित्यिकांचा जन्म आषाढ पौर्णिमेवर झाला; असा विश्वास आहे.",
      "importance": "या दिवशी केवळ गुरूच नाही तर जो कुटूंबात मोठा असेल म्हणजेच पालक, भावंडे इत्यादींनाही गुरु मानले पाहिजे. शिक्षकाच्या कृपेनेच विद्यार्थ्याला कळते. त्याच्या अंत: करणातील अज्ञान आणि अंधकार दूर होतो. गुरुचे आशीर्वाद कल्याणकारी, ज्ञानवर्धक आणि मंगळच आहेत. जगाचे सर्व शिक्षण गुरुच्या कृपेने होते. गुरूंकडून मंत्र मिळण्यासाठीही हा दिवस उत्तम आहे. या दिवशी शक्य तितक्या गुरुंची सेवा करण्याचे महत्त्व आहे."
    },
    {
      "Date": "रविवार 22 ऑगस्ट",
      "name": "श्रावण पौर्णिमा व्रत",
      "start": "पौर्णिमा सुरवात 19:02:22 पासुन. ऑगस्ट 21, 2021 रोजी",
      "end": "पौर्णिमा समाप्ती 17:33:39 पर्यंत. ऑगस्ट 22, 2021 रोजी",
      "info": "हिंदू कॅलेंडरनुसार श्रावण महिन्यातील पौर्णिमेला श्रावण किंवा श्रावणी पूर्णिमा म्हणतात. या दिवशी धार्मिक ग्रंथांमध्ये स्नान, तपस्या आणि दानशूरपणाला विशेष महत्त्व आहे. रक्षाबंधनाचा सणही श्रावण पौर्णिमेच्या दिवशी साजरा केला जातो. मध्य भारत आणि उत्तर भारतात काजरी पौर्णिमा हा सण श्रावण पौर्णिमेच्या दिवशीही साजरा केला जातो. या दिवशी यज्ञोपवीत पूजन आणि उपनयन संस्कार करण्याचा कायदा आहे. श्रावण पौर्णिमा हे चंद्रदोषांपासून मुक्तीसाठी सर्वोत्कृष्ट मानले जाते.",
      "importance": "श्रावण पौर्णिमा संपूर्ण भारतभरात वेगवेगळ्या धार्मिक श्रद्धाने साजरी केली जाते. उत्तर भारतात रक्षाबंधन हा पवित्र उत्सव या दिवशी साजरा केला जातो. दुसरीकडे या दिवशी दक्षिण भारतात नरियाली पौर्णिमा आणि अवनी अवित्तम साजरे केले जातात. मध्य भारतात काजरी पूनम आणि गुजरातमध्ये हे पवित्र स्थान म्हणून साजरे केले जाते. आशा पौर्णिमेच्या शुभ मुहूर्तावर अमरनाथचा पवित्र प्रवास सुरू होतो आणि ही यात्रा श्रावण पौर्णिमेला संपते. या दिवशी शिवलिंगाला जल अर्पण केले जाते आणि कावड यात्रा संपली."
    },
    {
      "Date": "सोमवार 20 सप्टेंबर",
      "name": "भाद्रपद पौर्णिमा व्रत",
      "start": "पौर्णिमा सुरवात 05:30:29 पासुन. सप्टेंबर 20, 2021 रोजी",
      "end": "पौर्णिमा समाप्ती 05:26:40 पर्यंत. सप्टेंबर 21, 2021 रोजी",
      "info": "हिंदू कॅलेंडरनुसार, भद्र महिन्यात येणार्‍या पौर्णिमेला भद्रपद पौर्णिमा म्हणतात. पूर्णिमाला हिंदू धर्मात विशेष महत्त्व देण्यात आले आहे. भद्रपद पौर्णिमेच्या दिवशी भगवान विष्णूच्या सत्यनारायण स्वरूपाची पूजा केली जाते, तसेच उमा-महेश्वर व्रत या दिवशी साजरा केला जातो. या पौर्णिमेला देखील महत्त्व आहे कारण या दिवशी, पितृ पक्ष अर्थात श्रद्धाची सुरुवात होते, जी अश्विन अमावस्येला संपते.",
      "importance": ""
    },
    {
      "Date": "बुधवार 20 ऑक्टोबर",
      "name": "अश्विन पौर्णिमा व्रत",
      "start": "पौर्णिमा सुरवात 19:05:43 पासुन. ऑक्टोबर 19, 2021 रोजी",
      "end": "पौर्णिमा समाप्ती 20:28:57 पर्यंत. ऑक्टोबर 20, 2021 रोजी",
      "info": "अश्विन महिन्याच्या तेजस्वी पंधरवड्याच्या पौर्णिमेला शरद पूर्णिमा म्हणतात. याला रस पूर्णिमा असेही म्हणतात. वैदिक ज्योतिषानुसार, संपूर्ण वर्षात या दिवशी चंद्र सोळा कलांचा असतो आणि त्यातून निघणारी किरणे अमृत मानली जातात. उत्तर आणि मध्य भारतात शरद पौर्णिमेच्या रात्री दुधाची खीर बनवून चंद्राच्या प्रकाशात ठेवली जाते. असे मानले जाते की जेव्हा चंद्राची किरणे खीरमध्ये पडतात तेव्हा ती अनेक पटीने आणि फायदेशीर ठरते. हा कोगाजारचा व्रत मानला जातो, त्याचप्रमाणे त्याला कौमुडी व्रत देखील म्हटले जाते.",
      "importance": "शरद पौर्णिमेला स्नान आणि उपवास सुरू होते. माता आपल्या मुलांच्या भल्यासाठी देवी-देवतांची उपासना करतात. या दिवशी चंद्र पृथ्वीच्या अगदी जवळ येतो. शरद .तूतील हवामान खूप स्पष्ट आहे. यावेळी आकाशात ढग किंवा धूळ नाही. शरद पूर्णिमाच्या रात्री अंगावर पडणार्‍या चंद्र किरणांना अत्यंत शुभ मानले जाते."
    },
    {
      "Date": "शुक्रवार 19 नोव्हेंबर",
      "name": "कार्तिक पौर्णिमा व्रत",
      "start": "पौर्णिमा सुरवात 12:02:50 पासुन. नोव्हेंबर 18, 2021 रोजी",
      "end": "पौर्णिमा समाप्ती 14:29:33 पर्यंत. नोव्हेंबर 19, 2021 रोजी",
      "info": "कार्तिक महिन्याच्या उज्ज्वल अर्ध्यावर पडणार्‍या पौर्णिमेला कार्तिक पूर्णिमा म्हणतात. या दिवशी महादेवजींनी त्रिपुरासुरा नावाच्या राक्षसाचा वध केला, म्हणून त्याला 'त्रिपुरी पौर्णिमा' असेही म्हणतात. कृतिका नक्षत्र जर या दिवशी असेल तर ते म्हणजे ‘महाकर्तीकी’. त्याच दिवशी, भरणी नक्षत्र असल्यास या पौर्णिमेचा पूर्ण परिणाम प्राप्त होतो. रोहिणी नक्षत्राचे महत्त्व पुढे वाढते. असे मानले जाते की कार्तिक पौर्णिमेच्या संध्याकाळी भगवान विष्णूला एक जलपरी होती. या दिवशी गंगा स्नानानंतर दीप-दानचे फळ दहा यज्ञांसारखेच आहे. ब्रह्मा, विष्णू, शिव, अंगिरा आणि आदित्य यांनी याला महापुनीत उत्सव म्हटले आहे.",
      "importance": "कार्तिक महिन्यात येणारी पौर्णिमा म्हणजे वर्षाच्या पवित्र पर्गमांपैकी एक. या दिवशी केलेली देणगी व दान ही कामे विशेष फलदायी असतात. जर या दिवशी कृतिका नक्षत्र आणि चंद्र वर विशाख नक्षत्र असेल तर पद्म योग तयार झाला आहे, जो अत्यंत दुर्मिळ आहे. याच दिवशी कृतिका नक्षत्रात चंद्र आणि बृहस्पति असल्यास त्यास महा पौर्णिमा म्हणतात. या दिवशी संध्याकाळी त्रिपुरत्सव करून दीप दान केल्याने पुनर्जन्म होत नाही."
    },
    {
      "Date": "रविवार 19 डिसेंबर",
      "name": "मार्गशीर्ष पौर्णिमा व्रत",
      "start": "पौर्णिमा सुरवात 07:26:35 पासुन. डिसेंबर 18, 2021 रोजी",
      "end": "पौर्णिमा समाप्ती 10:07:20 पर्यंत. डिसेंबर 19, 2021 रोजी",
      "info": "हिंदू धर्मात मार्गशीर्ष महिना हा दान व धर्म महिना मानला जातो. श्रीमद् भागवत गीतेमध्ये भगवान श्री कृष्णांनी स्वतः सांगितले आहे की महिन्यांत मी मार्गशीर्षाचा पवित्र महिना आहे. पौराणिक मान्यतांनुसार सत्याग्रह कालमार्गाशीर्ष महिन्यापासून सुरू झाला. या महिन्यात येणार्‍या पौर्णिमेला मार्गशीर्ष पूर्णिमा म्हणतात. या दिवशी स्नान, दान व ध्यान करण्याचे विशेष महत्त्व सांगितले गेले आहे. मार्गशीर्ष पौर्णिमेच्या दिवशी हरिद्वार, बनारस, मथुरा आणि प्रयागराज अशा ठिकाणी पवित्र नद्यांमध्ये भाविक स्नान करतात आणि ध्यान करतात.",
      "importance": "मार्गशीर्ष पौर्णिमेवरील तुळशीच्या मुळापासून पवित्र नदी, तलाव किंवा तलावामध्ये स्नान केल्याने भगवान विष्णूला विशेष आशीर्वाद मिळतो अशी पौराणिक मान्यता आहे. या दिवशी केलेल्या देणग्या इतर पौर्णिमापेक्षा 32 पट जास्त मिळतात, म्हणूनच याला बत्तीसी पौर्णिमा म्हणून देखील ओळखले जाते. मार्गशीर्ष पौर्णिमेनिमित्त भगवान सत्यनारायणाची पूजा आणि कथा देखील सांगितली जाते. हे अत्यंत फलदायी असल्याचे म्हटले जाते. कथेनंतर भगवान विष्णू या दिवशी शक्तीनुसार गरीब व ब्राह्मणांना अन्न आणि दान देऊन प्रसन्न झाले."
    }
  ],
  "ganesh":[
    {
      "Date": "सोमवार 13 जानेवारी",
      "name": "संकष्टी चतुर्थी"
    },
    {
      "Date": "बुधवार 12 फेब्रुवारी",
      "name": "संकष्टी चतुर्थी"
    },
    {
      "Date": "गुरुवार 12 मार्च",
      "name": "संकष्टी चतुर्थी"
    },
    {
      "Date": "शनिवार 11 एप्रिल",
      "name": "संकष्टी चतुर्थी"
    },
    {
      "Date": "रविवार 10 मे",
      "name": "संकष्टी चतुर्थी"
    },
    {
      "Date": "सोमवार 08 जून",
      "name": "संकष्टी चतुर्थी"
    },
    {
      "Date": "बुधवार 08 जुलै",
      "name": "संकष्टी चतुर्थी"
    },
    {
      "Date": "शुक्रवार 07 ऑगस्ट",
      "name": "संकष्टी चतुर्थी"
    },
    {
      "Date": "शनिवार 05 सप्टेंबर",
      "name": "संकष्टी चतुर्थी"
    },
    {
      "Date": "सोमवार 05 ऑक्टोबर",
      "name": "संकष्टी चतुर्थी"
    },
    {
      "Date": "बुधवार 04 नोव्हेंबर",
      "name": "संकष्टी चतुर्थी"
    },
    {
      "Date": "गुरुवार 03 डिसेंबर",
      "name": "संकष्टी चतुर्थी"
    }
  ],
  "monday":[
    {
      "date": "मंगळवार 21 जुलै",
      "name": "श्रावण मासारंभ"
    },
    {
      "date": "सोमवार 27 जुलै",
      "name": "श्रावणी सोमवार व्रत"
    },
    {
      "date": "सोमवार 03 ऑगस्ट",
      "name": "श्रावणी सोमवार व्रत"
    },
    {
      "date": "सोमवार 10 ऑगस्ट",
      "name": "श्रावणी सोमवार व्रत"
    },
    {
      "date": "सोमवार 17 ऑगस्ट",
      "name": "श्रावणी सोमवार व्रत"
    },
    {
      "date": "बुधवार 19 ऑगस्ट",
      "name": "श्रावण समाप्ती"
    }
  ]
  }