import React from 'react';
import { Component } from 'react';
import { Text, View, ScrollView, FlatList, Modal, StyleSheet, Alert, PanResponder, Share } from 'react-native';
import { Card, Icon, Button } from 'react-native-elements';
import { BannerAd } from '../../bannerAd';

const Separator = () => (
    <View style={styles.separator} />
  );

class ArtiForm extends Component {

    constructor(props){
        super(props);
    }

    render(){
        var flag = this.props.route.params.name;
        return(
            <ScrollView style={{backgroundColor: '#ffffff'}}> 
            <BannerAd/>
            {
            (flag == 'G') ? 
                <View>
                <Text style={styles.txt}>{'\n॥ श्री गणपतीची आरती ॥\n\nसुखकर्ता दुःखहर्ता वार्ता विघ्नाची।\nनुरवी पुरवी प्रेम कृपा जयाची।\nसर्वांगी सुन्दर उटि शेंदुराची।\nकण्ठी झळके माळ मुक्ताफळांची॥\nजय देव जय देव जय मंगलमूर्ति।\n\nदर्शनमात्रे मनकामना पुरती॥\nरत्नखचित फरा तुज गौरीकुमरा।\nचन्दनाची उटि कुंकुमकेशरा।\nहिरे जड़ित मुकुट शोभतो बरा।\nरुणझुणती नूपुरे चरणी घागरिया॥\nजय देव जय देव जय मंगलमूर्ति।\n\nदर्शनमात्रे मनकामना पुरती॥\nलम्बोदर पीताम्बर फणिवर बन्धना।\nसरळ सोण्ड वक्रतुण्ड त्रिनयना।\nदास रामाचा वाट पाहे सदना।\nसंकटी पावावे निर्वाणीरक्षावे सुरवरवन्दना॥\nजय देव जय देव जय मंगलमूर्ति।\nदर्शनमात्रे मनकामना पुरती॥\n'}</Text>
                </View>
                : (flag == 'D') ? 
                <View>
                <Text style={styles.txt}>{'\n\n॥ श्री दत्ताची आरती ॥\n\nत्रिगुणात्मक त्रैमूर्ती दत्त हा जाणा।\nत्रिगुणी अवतार त्रैलोक्यराणा।\nनेती नेती शब्द न ये अनुमाना।\nसुरवर मुनिजन योगी समाधि न ये ध्याना॥\nजय देव जय देव जय श्री गुरुदत्ता।\nआरती ओवाळीतां हरली भवचिन्ता॥\n\nसबाह्य अभ्यंतरी तू एक दत्त।\nअभाग्यासी कैसी न कळे ही मात।\nपराही परतली तेथे कैचा हेत।\nजन्ममरणाचा पुरलासे अन्त॥\nजय देव जय देव जय श्री गुरुदत्ता।\nआरती ओवाळीतां हरली भवचिन्ता॥\n\nदत्त येऊनियां ऊभा ठाकला।\nसद्भावे साष्टांगे प्रणिपात केला।\nप्रसन्न होऊनी आशीर्वाद दिधला।\nजन्ममरणाचा फेरा चुकविला॥\nजय देव जय देव जय श्री गुरुदत्ता।\nआरती ओवाळीतां हरली भवचिन्ता॥\n\nदत्त दत्त ऐसे लागले ध्यान।\nहरपलें मन झालें उन्मन।\nमी तू पणाची झाली बोळवण।\nएका जनार्दनी श्रीदत्तध्यान॥\nजय देव जय देव जय श्री गुरुदत्ता।\nआरती ओवाळीतां हरली भवचिन्ता॥'}</Text>
                </View>
                : (flag == 'S') ? 
                <View>
                <Text style={styles.txt}>{'॥ श्री शंकराची आरती ॥\n\nलवथवती विक्राळा ब्रह्माण्डी माळा।\nवीषे कण्ठ काळा त्रिनेत्री ज्वाळा।\nलावण्य सुन्दर मस्तकी बाळा।\nतेथुनिया जळ निर्मळ वाहे झुळझुळा॥\nजय देव जय देव जय श्रीशंकरा।\nआरती ओवाळू तुज कर्पुरगौरा॥\n\nकर्पुर्गौरा भोळा नयनी विशाळा।\nअर्धांगी पार्वती सुमनांच्या माळा।\nविभुतीचे उधळण शितिकण्ठ नीळा।\nऐसा शंकर शोभे उमावेल्हाळा॥\nजय देव जय देव जय श्रीशंकरा।\nआरती ओवाळू तुज कर्पुरगौरा॥\n\nदेवी दैत्यी सागरमन्थन पै केलें।\nत्यामाजी अवचित हळाहळ जें उठिले।\nते त्वां असुरपणे प्राशन केलें।\nनीलकण्ठ नाम प्रसिद्ध झालें॥\nजय देव जय देव जय श्रीशंकरा।\nआरती ओवाळू तुज कर्पुरगौरा॥\n\nव्याघ्राम्बर फणिवरधर सुन्दर मदनारी।\nपंचानन मनमोहन मुनिजन सुखकारी।\nशतकोटीचें बीज वाचे उच्चारी।\nरघुकुळटिळक रामदासा अन्तरी॥\nजय देव जय देव जय श्रीशंकरा।\nआरती ओवाळू तुज कर्पुरगौरा॥\n'}</Text>
                </View>
                : (flag == 'V') ? 
                <View>
                <Text style={styles.txt}>{'\n\n॥ श्री विठोबाची आरती ॥\n\nयुगें अठ्ठावीस विटेवरी उभा।\nवामांगी रखुमाई दिसे दिव्य शोभा।\nपुण्डलिकाचे भेटी परब्रह्म आलें गा।\nचरणी वाहे भीमा उद्धरी जगा॥\nजय देव जय देव जय पाण्डुरंगा।\nरखुमाईवल्लभा राईच्या वल्लभा पावें जिवलगा॥\n\nतुळसीमाळा गळां कर ठेवुनि कटीं।\nकांसे पीताम्बर कस्तुरि लल्लाटी।\nदेव सुरवर नित्य येती भेटी।\nगरुड हनुमन्त पुढे उभे राहती॥\nजय देव जय देव जय पाण्डुरंगा।\nरखुमाईवल्लभा राईच्या वल्लभा पावें जिवलगा॥\n\nधन्य वेणुनाद अनुक्षेत्रपाळा।\nसुवर्णाची कमळे वनमाळा गळां।\nराही रखुमाबाई राणीया सकळा।\nओवाळिती राजा विठोबा सांवळा॥\nजय देव जय देव जय पाण्डुरंगा।\nरखुमाईवल्लभा राईच्या वल्लभा पावें जिवलगा॥\n\nओवाळूं आरत्या कुर्वण्ड्या येती।\nचन्द्रभागेमाजी सोडुनियां देती।\nदिंड्या पताका वैष्णव नाचती।\nपंढरीचा महिमा वर्णावा किती॥\nजय देव जय देव जय पाण्डुरंगा।\nरखुमाईवल्लभा राईच्या वल्लभा पावें जिवलगा॥\n\nआषाढी कार्तिकी भक्तजन येती।\nचन्द्रभागेमाजी स्नाने जे करिती।\nदर्शनहेळामात्रें तयां होय मुक्ती।\nकेशवासी नामदेव भावे ओंवाळिती॥\nजय देव जय देव जय पाण्डुरंगा।\nरखुमाईवल्लभा राईच्या वल्लभा पावें जिवलगा॥'}</Text>
                </View>
                :  (flag == 'DD') ? 
                <View>
                <Text style={styles.txt}>{'\n\n॥ श्री दुर्गा देवीची आरती ॥\n\nदुर्गे दुर्घट भारी तुजविण संसारी।\nअनाथ नाथे अम्बे करुणा विस्तारी।\nवारी वारी जन्म मरणांते वारी।\nहारी पडलो आता संकट निवारी॥\nजय देवी जय देवी महिषासुरमथिनी।\nसुरवर ईश्वर वरदे तारक संजीवनी॥\n\nत्रिभुवन-भुवनी पाहता तुज ऐसी नाही।\nचारी श्रमले परन्तु न बोलवे काही।\nसाही विवाद करिता पडले प्रवाही।\nते तू भक्तालागी पावसि लवलाही॥\nजय देवी जय देवी महिषासुरमथिनी।\nसुरवर ईश्वर वरदे तारक संजीवनी॥\n\nप्रसन्न वदने प्रसन्न होसी निजदासा।\nक्लेशांपासुनि सोडवि तोडी भवपाशा।\nअम्बे तुजवाचून कोण पुरविल आशा।\nनरहरी तल्लिन झाला पदपंकजलेशा॥\nजय देवी जय देवी महिषासुरमथिनी।\nसुरवर ईश्वर वरदे तारक संजीवनी॥'}</Text>
                </View>
                :  (flag == 'GM') ? 
                <View>
                <Text style={styles.txt}>{'\nगजानन महाराज आरती\n\n\nजय जय सत्चितस्वरूपा स्वामी गणराया ।\nअवतरलासी भूवर जड़ मूढ ताराया ।\nजयदेव जयदेव ॥धृ॥\n\nनिर्गुण ब्रह्म सनातन अव्यय अविनाशी ।\nस्थिरचर व्यापुन उरले जे या जगतासी ।\nतें तू तत्त्व खरोखर नि:संशय अससी ।\nलीलामात्रे धरिले मानवदेहासी ॥१॥\n\n\nहोऊ न देशी त्याची जाणिव तू कवणा ।\nकरूनि ‘गणि गण गणात बोते’ या भजना ।\nधाता हरिहर गुरूवर तूची सुखसदना ।\nजिकडे पाहावे तिकडे तू दिससी नयना ॥२॥\n\nलीला अनंत केल्या बंकटसदनास ।\nपेटविले त्या अग्नीवाचुनि चिलमेस ।\nक्षणात आणिले जीवन निर्जल वापीस ।\nकेला ब्रह्मगिरीच्या गर्वाचा नाश ॥३॥\n\nव्याधी वारून केले कैकां संपन्न ।\nकरविले भक्तालागी विट्ठलदर्शन ।\nभवसिंधु हा तरण्या नौका तव चरण ।\nस्वामी दासगणूचे मान्य करा कवन ॥४॥\n'}</Text>
                </View>
                : (flag == 'ML') ? 
                <View>
                <Text style={styles.txt}>{'\n॥ श्री महालक्ष्मीची आरती ॥\n\nजय देवी जय देवी जय महालक्ष्मी।\nवससी व्यापकरुपे तू स्थूलसूक्ष्मी॥\nकरवीरपुरवासिनी सुरवरमुनिमाता।\nपुरहरवरदायिनी मुरहरप्रियकान्ता।\nकमलाकारें जठरी जन्मविला धाता।\nसहस्त्रवदनी भूधर न पुरे गुण गातां॥\nजय देवी जय देवी...॥\n\nमातुलिंग गदा खेटक रविकिरणीं।\nझळके हाटकवाटी पीयुषरसपाणी।\nमाणिकरसना सुरंगवसना मृगनयनी।\nशशिकरवदना राजस मदनाची जननी॥\nजय देवी जय देवी...॥\n\nतारा शक्ति अगम्या शिवभजकां गौरी।\nसांख्य म्हणती प्रकृती निर्गुण निर्धारी।\nगायत्री निजबीजा निगमागम सारी।\nप्रगटे पद्मावती निजधर्माचारी॥\nजय देवी जय देवी...॥\n\nअमृतभरिते सरिते अघदुरितें वारीं।\nमारी दुर्घट असुरां भवदुस्तर तारीं।\nवारी मायापटल प्रणमत परिवारी।\nहें रुप चिद्रूप दावी निर्धारी॥\nजय देवी जय देवी...॥\n\nचतुराननें कुश्चित कर्मांच्या ओळी।\nलिहिल्या असतिल माते माझे निजभाळी।\nपुसोनि चरणातळी पदसुमने क्षाळी।\nमुक्तेश्वर नागर क्षीरसागरबाळी॥\nजय देवी जय देवी...॥'}</Text>
                </View>
                : (flag == 'DN') ? 
                <View>
                <Text style={styles.txt}>{'\nज्ञानराजा आरती \n\nआरती ज्ञानराजा । महाकैवल्यतेजा ।\n सेविती साधुसंत ॥ मनु वेधला माझा ॥ धृ ॥\n\nलोपलें ज्ञान जगी । हित नेणती कोणी ॥\nअवतार पांडुरंग । नाम ठेविले ज्ञानी ॥\n\nकनकाचे ताट करी । उभ्या गोपिका नारी ॥\nनारद तुंबर हो । साम गायन करी ॥\n\nप्रकट गुह्य बोले । विश्र्व ब्रम्हाची केलें ॥\nरामजनार्दनी । पायी मस्तक ठेविले ॥\n\nआरती ज्ञानराजा । महाकैवल्यतेजा ॥\n सेविती साधुसंत । मनु वेधला माझा ॥'}</Text>
                </View>
                : (flag == 'GS') ? 
                <View>
                <Text style={styles.txt}>{'\nगौरीशंकर आरती\n\nकर्पूरगौरा गौरीशंकरा आरती करू तुजला ।\nनाम स्मरतां प्रसन्न हो उनि पावसि भक्ताला ॥ श्रु० ॥\n\nत्रिशूळ डमरू शोभत हस्ती कंठि रुंडमाळा ।\nउग्रविषाते पिऊनी रक्षिसी देवां दिक्पाळा ॥\nतृतीय नेत्री निघती क्रोधे प्रळयाग्नीज्वाळा ।\nनमिती सुरमुनि तुजला ऐसा तू शंकर भोळा ॥ १ ॥\n\nढवळा नंदी वाहनशोभे अर्धांगी गौरी ।\nजटा मुकुटी वासकरितसे गंगासुंदरी ॥\nसदया सगुणा गौरीरमणा मम संकट वारी ।\nमोरेश्वरसुत वासुदेव तुज स्मरतो अंतरी ॥ २ ॥'}</Text>
                </View>
                : (flag == 'SB') ? 
                <View>
                <Text style={styles.txt}>{'\nसाईबाबा आरती\n\nआरती साईबाबा।सौख्यदातारा जीवा।\nचरणरजतळीं निज दासां विसावां।भक्तां विसावा॥धृ॥\n\nजाळुनियां अनंग। स्वस्वरुपी राहे दंग।\nमुमुक्षुजना दावी।निजडोळां श्रीरंग॥१॥\n\nजया मनीं जैसा भाव।तया तैसा अनुभव।\nदाविसी दयाघना।ऐसी ही तुझी माव॥२॥\n\nतुमचें नाम ध्यातां।हरे संसृतिव्यथा।\nअगाध तव करणी।मार्ग दाविसी अनाथा॥३॥\n\nकलियुगीं अवतार।सगुणब्रह्म साचार।\nअवतीर्ण झालासे।स्वामी दत्त दिगंबर॥४॥\n\nआठा दिवसां गुरुवारी।भक्त करिती वारी।\nप्रभुपद पहावया।भवभय निवारी॥५॥\n\nमाझा निजद्रव्य ठेवा।तव चरणसेवा।\nमागणें हेंचि आता।तुम्हा देवाधिदेवा॥६॥\n\nइच्छित दीन चातक।निर्मळ तोय निजसुख।\nपाजावें माधवा या।सांभाळ आपुली भाक॥७॥\n'}</Text>
                </View>
                : (flag == 'M8') ? 
                <View>
                <Text style={styles.txt}>{'\n॥ महालक्ष्म्यष्टकम ॥\n\nनमस्तेऽस्तु महामायेश्रीपीठे सुरपूजिते।\nशङ्खचक्रगदाहस्तेमहालक्ष्मि नमोऽस्तुते॥१॥\n\nनमस्ते गरुडारूढेकोलासुरभयंकरि।\nसर्वपापहरे देविमहालक्ष्मि नमोऽस्तुते॥२॥\n\nसर्वज्ञे सर्ववरदेसर्वदुष्टभयंकरि।\nसर्वदुःखहरे देविमहालक्ष्मि नमोऽस्तुते॥३॥\n\nसिद्धिबुद्धिप्रदे देविभुक्तिमुक्तिप्रदायिनि।\nमन्त्रमूर्ते सदा देविमहालक्ष्मि नमोऽस्तुते॥४॥\n\nआद्यन्तरहिते देविआद्यशक्तिमहेश्वरि।\nयोगजे योगसम्भूतेमहालक्ष्मि नमोऽस्तुते॥५॥\n\nस्थूलसूक्ष्ममहारौद्रेमहाशक्तिमहोदरे।\nमहापापहरे देविमहालक्ष्मि नमोऽस्तुते॥६॥\n\nपद्मासनस्थिते देविपरब्रह्मस्वरूपिणि।\nपरमेशि जगन्मातर्महालक्ष्मि नमोऽस्तुते॥७॥\n\nश्वेताम्बरधरे देविनानालङ्कारभूषिते।\nजगत्स्थिते जगन्मातर्महालक्ष्मि नमोऽस्तुते॥८॥\n\nमहालक्ष्म्यष्टकं स्तोत्रंयः पठेद्भक्तिमान्नरः।\nसर्वसिद्धिमवाप्नोतिराज्यं प्राप्नोति सर्वदा॥९॥\n\nएककाले पठेन्नित्यंमहापापविनाशनम्।\nद्विकालं यः पठेन्नित्यंधनधान्यसमन्वितः॥१०॥\n\nत्रिकालं यः पठेन्नित्यंमहाशत्रुविनाशनम्।\nमहालक्ष्मिर्भवेन्नित्यंप्रसन्ना वरदा शुभा॥११॥\n\n॥ इति श्री महालक्ष्मीस्तव ॥'}</Text>
                </View>
                :(flag == 'MP') ? 
                <View>
                <Text style={styles.txt}>{'\nमंत्रपुष्पांजली\n\nॐ यज्ञेन यज्ञमयजन्त देवास्तनि धर्माणि प्रथमान्यासन् ।\nते ह नाकं महिमान : सचंत यत्र पूर्वे साध्या : संति देवा : ।।\n\nॐ राजाधिराजाय प्रसह्य साहिने ।\nनमो वयं वैश्रवणाय कुर्महे ।\nस मस कामान् काम कामाय मह्यं।\nकामेश्र्वरो वैश्रवणो ददातु कुबेराय वैश्रवणाय ।\nमहाराजाय नम: ।\n\nॐ स्वस्ति। साम्राज्यं भौज्यं स्वाराज्यं\nवैराज्यं पारमेष्ठ्यं राज्यं महाराज्यमाधिपत्यमयं\nवैराज्यं पारमेष्ठ्यं राज्यं महाराज्यमाधिपत्यमयं\nसमंतपर्यायीस्यात् सार्वभैम: सार्वायुष आं\nतादापरार्धात् पृथिव्यै समुद्रपर्यंताया एकेराळिति\nतदप्येष: श्लोको भिगीतो मरूत: परिवेष्टारो\nमरूतस्यावसन् गृहे ।\n\nआविक्षितस्य कामप्रेर्विश्र्वेदेवा: सभासद इति ।।\nएकदंतायविघ्महे वक्रतुण्डाय धीमहि ।\nतन्नोदंती प्रचोदयात् ।\nमंत्रपुष्पांजली समर्पयामि ।।'}</Text>
                </View>
                :(flag == 'GL') ? 
                <View>
                <Text style={styles.txt}>{'\nघालिन लोटांगण\n\nघालीन लोटांगण वंदीन चरण ।\nडोळ्यांनी पाहिन रूप तुझे ।\nप्रेमें आलिंगीन आनंद पूजन ।\nभावे ओवाळिन म्हणे नामा ।।\n\nत्वमेव माता पिता त्वमेव ।\nत्वमेव बन्धु: सखा त्वमेव ।\nत्वमेव विद्या द्रविणं त्वमेव ।\nत्वमेव सर्वं मम देवदेव ।।\n\nकायेन वाचा मनसेंद्रियैर्वा ।\nबुध्यात्मना वा प्रकृति स्वभावात् ।\nकरमि यद्यत् सकलं परस्मै ।\nनारायणायेती समर्पयामि ।।\n\nअच्युतं केशवं राम नारायणम्\nकृष्णदामोदरं वासुदेवं भजे।\nश्रीधरं माधवं गोपिकावल्लभम्\nजानकीनायकं रामचंद्र भजे ।।\n\nहरे राम हरे राम राम राम हरे हरे\nहरे कृष्ण हरे कृष्ण कृ्ष्ण कृ्ष्ण हरे हरे ।।\n\n।। मंगलमुर्ती मोरया ।।\n।। गणपतिबाप्पा मोरया ।।'}</Text>
                </View>
                :(flag == 'SS') ? 
                <View>
                <Text style={styles.txt}>{'\nज्या ज्या स्थळीं हे मन जाय माझे । \nत्या त्या स्थळीं हे निज रूप तुझे । \nमी ठेवितो मस्तक ज्या ठिकाणी । \nतेथे तुझे सद्गुरू पाय दोन्ही ।। \n \n \nसदा सर्वदा योग तुझा घडावा । \nतुझे कारणी देह माझा पडावा । \nउपेक्षु नको गुण वंता अनंता । \nरघु नायका मागणे हेची आता ।। \n \nउपासनेला दृढ चालवावे । \nभूदेव संतांसी सदा नमावे । \nसत्कर्म योगे वय घालवावे । \nसर्वा मुखी मंगल बोलवावे ।। \n \n।। जय जय रघुवीर समर्थ ।।'}</Text>
                <Separator/>
                <Text style={styles.txt}>{'\nकराग्रे वसतें लक्ष्मी: करमध्ये सरस्वती । \nकरमुले तु गोविन्दः प्रभाते करदर्शनम् ।। \nसमुद्रवसने देवि पर्वतस्तनमण्डले । \nविष्णुपत्नि ! नमस्तुभ्यं पादस्पर्श क्षमस्वमे ।।'}</Text>
                <Separator/>
                <Text style={styles.txt}>{'\nजनीं भोजनी नाम वाचे वदावे । \nअती आदरे गद्यघोषे म्हणावे । \nहरीचिंतने अन्न सेवित जावे । \nतरी श्रीहरी पाविजेतो स्वभावे ॥१॥ \n\n ।। जय जय रघुवीर समर्थ ।। \n \n \nवदनि कवळ घेता नाम घ्या श्रीहरीचे । \nसहज हवन होते नाम घेता फुकाचे । \nजीवन करि जिवित्वा अन्न हे पूर्णब्रह्म । \nउदरभरण नोहे जाणिजे यज्ञकर्म ॥१॥ \n \n।। जय जय रघुवीर समर्थ ।।'}</Text>
                <Separator/>
                <Text style={styles.txt}>{'\nन ये राम वाणी तया थोर हाणी । \nजनीं व्यर्थ प्राणी तया नाम काणी ॥ \nहरीनाम हे वेदशास्त्री पुराणी । \nबहू आगळे बोलिली व्यासवाणी ॥ \n \nजनीं भोजनीं नाम वाचे वदावे । \nअती आदरे गद्यघोषे म्हणावे ॥ \nहरीचिंतने अन्न सेवीत जावे । \nतरी श्रीहरी पाविजेतो स्वभावे ॥ \n \nबहू चांगले नाम या राघवाचे । \nअती साजिरे स्वल्प सोपे फुकाचे ॥ \nकरी मूळ निर्मूळ घेता भवाचे । \nजिवा मानवा हेचि कैवल्य साचे ॥ \n \nमुखी राम त्या काम बाधू शकेना । \nगुणे इष्ट धारिष्ट त्याचे चुकेना ॥ \nहरीभक्त तो शक्त कामास भारी । \nजगी धन्य तो मारुती ब्रह्मचारी ॥ \n \nमुखी राम विश्राम तेथेचि आहे । \nसदानंद आनंद सेवोनि आहे ॥ \nतयावीण तो शीण संदेहकारी । \nनिजधाम हे नाम शोकापहारी ॥ \n \nभजा राम विश्राम योगेश्वरांचा । \nजपू नेमिला नेम गौरीहराचा ॥ \nस्वये नीववी तापसी चंद्रमौळी । \nतुम्हां सोडवी राम हा अंतकाळी ॥ \n \nविठोने शिरी वाहिला देवराणा । \nतया अंतरी ध्यास रे त्यासि नेणा ॥ \nनिवाला स्वये तापसी चंद्रमौळी । \nजिवा सोडवी राम हा अंतकाळी ॥ \n \nजेणे जाळिला काम तो राम ध्यातो । \nउमेसी अती आदरे गूण गातो ॥ \nबहु ज्ञान वैराग्य सामर्थ्य जेथे । \nपरी अंतरी नामविश्वास तेथे ॥ \n \nमना मत्सरे नाम सांडू नको हो । \nअती आदरे हा निजध्यास राहो ॥ \nसमस्तांमधे नाम हे सार आहे । \nदुजी तूळणा तूळिताही न साहे ॥'}</Text>
                </View>
                :(flag == 'GNS') ? 
                <View>
                <Text style={styles.txt}>{'\nश्री गणपती स्तोत्र \n\nप्रणम्य शिरसा देवं गौरीपुत्रं विनायकम ॥\nभक्तावासं स्मरेन्नित्यमायु:कामार्थसिद्धये ॥ १ ॥\n\nप्रथमं वक्रतुंडं च एकदंतं द्वितीयकम ॥\nतृतीयं कृष्णपिंगाक्षं गजवक्त्रं चतुर्थकम ॥ २ ॥\n\nलंबोदरं पंचमं च षष्ठं विकटमेव च ॥\nसप्तमं विघ्नराजेंद्रं धूम्रवर्णं तथाष्टमम ॥ ३ ॥\n\nनवमं भालचंद्रं च दशमं तु विनायकम ॥\nएकादशं गणपतिं द्वादशं तु गजाननम ॥ ४ ॥\n\nद्वादशितानि नामानि त्रिसंध्यं यः पठेन्नरः ॥\nन च विघ्नभयं तस्य सर्वसिद्धिकरं प्रभो ॥ ५ ॥\n\nविद्यार्थी लभते विध्यां धनार्थी लभते धनम ॥\nपुत्रार्थी लभते पुत्रन मोक्षार्थी लभते गतिम ॥ ६ ॥\n\nजपेद्गणपतिस्तोत्रं षडभिर्मासै: फलं लभेत ॥\nसंवत्सरेण सिद्धिं च लभते नात्र संशय: ॥ ७ ॥\n\nअष्टभ्यो ब्राह्मणेभ्यश्च लिखित्वा यः समर्पयेत ॥\nतस्य विद्या भवेत्सर्वा गणेशस्य प्रसादत: ॥ ८ ॥\n\nइति श्रीनारदपुराणे संकटनाशनं नाम श्रीगणपतिस्तोत्रं संपूर्णम ॥'}</Text>
                </View>
                :(flag == 'MRS') ? 
                <View>
                <Text style={styles.txt}>{'\nश्री मारुतीस्तोत्रं स्तोत्र \n\nभीमरुपी महारुद्रा, वज्रहनुमान मारुती । \nवानरी अंजनीसुता, रामदुता प्रभंजना ॥ १ ॥ \n \nमहाबली प्राणदाता, सकळा उठवी बळे । \nसौख्यकारी दु:खहारी, धूर्त वैष्णव गायका ॥ २ ॥ \n \nदीननाथा हरीरुपा, सुंदरा जगदंतरा| \nपातालदेवता हंता, भव्य सिंदुर लेपना ॥ ३ ॥ \n \nलोकनाथा, जगन्नाथा, प्राणनाथा पुरातना| \nपुण्यवंता, पुण्यशिळा, पावना परितोषका ॥ ४ ॥ \n \nध्वजांगे उचली बाहो, आवेशे लोटला पुढे| \nकाळाग्नी काळरुद्राग्नी, देखता कांपती भये ॥ ५ ॥ \n \nब्रम्हांडे माईली नेणों आंवाळे दंतपंक्ती| \nनेत्राग्नी चालील्या ज्वाळा, भ्रुकुटी ताठिल्या बळे ॥ ६ ॥ \n \nपुच्छ ते मुर्डीले माथा, किरीटी कुंडले बरी| \nसुवर्ण कटी कांसोटी , घंटा किंकिणी नागरा ॥ ७ ॥ \n \nठकारे पर्वता ऐसा, नेटका सडपात़ळु| \nचपळांग पाहता मोठे, महाविद्युल्लतेपरी ॥ ८ ॥ \n \nकोटीच्या कोटी उड्डाणे, झेपावे उत्तरेकडे| \nमंद्रादीसारखा द्रोणु क्रोधे उत्पाटिला बळे ॥ ९ ॥ \n \nआणिला मागुती नेला, आला गेला मनोगती| \nमनासी टाकीले मागे, गतिसी तुळणा नसे ॥ १० ॥ \n \nअणुपासुनि ब्रम्हांडाएवढा होत जातसे, \nतयासी तुळणा कोठे, मेरुमंदार धाकुटे ॥ ११ ॥ \n \nब्रम्हांडाभोवते वेढे, वज्रपुच्छे करु शके| \nतयासी तुळणा कैंची, ब्रम्हांडी पाहता नसे ॥ १२ ॥ \n \nआरक्त देखिले डोळा, ग्रासिले सूर्यमंडळा| \nवाढता वाढता वाढे, भेदिले शून्यमंडळा ॥ १३ ॥ \n \nधनधान्यपशुवृद्धी, पुत्रपौत्रसमस्तही| \nपावती रुपविद्यादी स्तोत्रपाठेकरुनिया ॥ १४ ॥ \n \nभूतप्रेतसमंधादि रोगव्याधीसमस्तही| \nनासती तुटती चिंता आनंदे भीमदर्शने ॥ १५ ॥ \n \nहे धरा पंधराश्लोकी लाभली शोभली बरी| \nदृढदेहो, निसंदेहो, संख्याचंद्रकळागुणे ॥ १६ ॥ \n \nरामदासी अग्रगण्यु, कपीकुळासी मंडणु| \nरामरुपी अंतरात्मा, दर्शने दोषनासती ॥ १७ ॥ \n \n॥ इती श्री रामदासकृतं संकटनिरसनं मारुतीस्तोत्रं सम्पूर्णं ॥'}</Text>
                </View>
                : <Text></Text>
            }
            <BannerAd/>
            </ScrollView>);
    }
}

const styles = StyleSheet.create({
    separator: {
        marginVertical: 5,
        borderBottomColor: '#737373',
        borderBottomWidth: StyleSheet.hairlineWidth,
      },
    title:{
        fontFamily: 'monospace',
        fontSize:20,
        textAlign:"center"
    },
    txt:{
        fontFamily: 'sans-serif-condensed',
        margin:10,
        textAlign:"center"
    },
    buttonContainer: {
        flex: 1,
        flexDirection: 'row',
        marginTop : 15,
        marginHorizontal: 16,
        alignItems: 'center',
        justifyContent: 'space-evenly'
      },
      cardContainer:{
        borderColor:'red',
      },
      instTitle:{
          fontFamily: 'sans-serif-condensed',
          fontSize:20,
          textAlign:"center"
      }
    });

export default (ArtiForm);